### List Of list to DataFrame

In [1]:
import pandas as pd

In [5]:
data = [['Dharmik', 58], ['Kirti', 75], ['Vishwa', 81], ['Vraj', 61]]

In [6]:
data

[['Dharmik', 58], ['Kirti', 75], ['Vishwa', 81], ['Vraj', 61]]

In [7]:
pd.DataFrame(data, columns=["Name", "Marks"])

      Name  Marks
0  Dharmik     58
1    Kirti     75
2   Vishwa     81
3     Vraj     61

 ### Create Python Dictionary to Dataframe

In [8]:
data = {'a': [17, 72, 19], 'b': [82, 23, 63]}

In [9]:
data

{'a': [17, 72, 19], 'b': [82, 23, 63]}

In [10]:
df = pd.DataFrame(data)

In [12]:
df

    a   b
0  17  82
1  72  23
2  19  63

### Create Numpy to DataFrame

In [13]:
import numpy as np

In [14]:
arr = np.array([[1, 2], [5, 6]])

In [15]:
df = pd.DataFrame(arr, columns=["A", "B"])
df

   A  B
0  1  2
1  5  6

### Create an Excel to DataFrame

In [22]:
pip install openpyxl

Collecting openpyxl
  Downloading openpyxl-3.1.5-py2.py3-none-any.whl.metadata (2.5 kB)
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-2.0.0-py3-none-any.whl.metadata (2.7 kB)
Downloading openpyxl-3.1.5-py2.py3-none-any.whl (250 kB)
Downloading et_xmlfile-2.0.0-py3-none-any.whl (18 kB)
Installing collected packages: et-xmlfile, openpyxl

   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   -------------------- ------------------- 1/2 [openpyxl]
   ---------------------------------------- 2/2 [openpyxl]

Successfully installed et-xmlfile-2.0.0 openpyxl-3.1.5
Note: you may need to restart the kernel to use updated packages.

In [24]:
df = pd.read_excel("Data.xlsx")

In [25]:
df

      Name School  Marks
0  Dharmik    PDS     48
1    Kirti    JKS     83
2    Harsh    HKS     36
3   Khushi    SSG     93
4  Brijesh    DBL     83
5    Mayur    FPS     81
6    Krupa    UPS     56
7   Vishwa    RRS     97
8     Vraj    RTS     81

### Create an csv to DataFrame

In [26]:
df = pd.read_csv("Data.csv")

In [27]:
df

      Name School  Marks
0  Dharmik    PDS     48
1    Kirti    JKS     83
2    Harsh    HKS     36
3   Khushi    SSG     93
4  Brijesh    DBL     83
5    Mayur    FPS     81
6    Krupa    UPS     56
7   Vishwa    RRS     97
8     Vraj    RTS     81

### Create an json to DataFrame

In [31]:
df = pd.read_json("data.json", orient="records")

In [32]:
df

   id   name friends liked_pages
0   1   Amit  [2, 3]       [101]
1   2  Priya  [1, 4]       [102]
2   3  Rahul     [1]          []

### Create an URL to DataFrame

In [33]:
df = pd.read_csv("https://raw.githubusercontent.com/mwaskom/seaborn-data/master/tips.csv")

In [34]:
df

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]